"use strict";
//  На екрані виводиться меню:
// 1. Сказати «Привіт».
// 2. Сказати «Зачекай».
// 3. Сказати «До побачення».
// 4. Вихід.
// Шляхом вибору пунктів меню виводити відповідні повідомлення, поки не буде вибрано пункт номер 4.
let userChoice;
alert("Вітаємо в меню! Виберіть пункт:\n 1. Сказати «Привіт».\n2. Сказати «Зачекай».\n3. Сказати «До побачення».\n4. Вихід.");
do {
    userChoice = parseInt(prompt("Виберіть пункт меню:", "1"));
    switch (userChoice) {
        case 1:
            alert(`Привіт!`);
            break;
        case 2:
            alert(`Зачекай!`);
            break;
        case 3:
            alert(`До побачення`);
            break;
        case 4:
            alert(`Вихід`);
            break;
        default:
            alert(`Невірний вибір. Будь ласка, виберіть пункт меню від 1 до 4.`);
            break;
    }
} while (userChoice !== 4);
//# sourceMappingURL=task_5.js.map