"use strict";
// Задача 1. Дано масив рядків. Вивести ті, у яких є цифри (використати метод test та регулярні вирази).
const list = ["Mavis", "gdh", "Leo", "tff", "3535", "Molly", "Felix", "9898", "3243", "Auy", "cctv", "123", "1111"];
const listNumber = list.filter(item => /\d/.test(item));
console.log(listNumber);
/* list.forEach(item => {
const regex =/\d/.test(item)
  console.log(regex);
  
});  */
// ======================================================================
// Задача 2. Дано масив рядків. Вивести ті, у яких немає цифр.
const listNoNumber = list.filter(item => /\D/.test(item));
console.log(listNoNumber);
// ========================================================================
// Задача 3. Дано масив рядків. Вивести ті, у яких є голосні літери.
const vowelLetters = list.filter(item => /[aouyie]/i.test(item));
console.log(vowelLetters);
// ======================================================================
// Задача 4. Дано масив рядків. Вивести ті, у яких немає голосних літер.
const consonantLetters = list.filter(item => !(/[aouyie]/i.test(item)) && !(/\d/.test(item)));
console.log(consonantLetters);
// ======================================================================
// Задача 5. Дано масив рядків. Вивести ті, у яких є або цифра 1 або цифра 3.
const searchNumber = list.filter(item => /[13]/.test(item));
console.log(searchNumber);
// ===========================================================================
// Задача 6. Дано рядок тексту, вивести усі числа, які є у тексті.
const text = "Ціна товару становить 250 грн, а знижка діє до 15.07.2026 року.";
const result = text.match(/\d/g);
console.log(result);
// Задача 7. Дано рядок тексту. Знайти усі знаки пунктуації, які були використано.
const text2 = "Привіт, світ! Як справи? — спитав він. — Усе добре...";
// const result2 = (text2.match(/[,!?.—]/g))
// const result2 = (text2.match(/[^а-яієїґ0-9 _]/gi))
const result2 = (text2.match(/[^а-яієїґ\d\s_]/gi));
console.log(result2);
// =================================================================================
// Задача 8. Дано рядок тексту. Вивести усі складові, які розділені розділовими знаками.
const result3 = text2.match(/([а-яієїґ]+)/uig);
console.log(result3);
// Задача 9. Дано рядок тексту. Перевірити, чи містить він дату у форматі dd.mm.yyyy (dd- день, mm- місяць, yyyy- рік).
const text3 = "Користувача зареєстровано 15.08.2024 о 14:30.";
const regex = /\d{2}\.\d{2}\.\d{4}/g;
const check = Boolean(text3.match(regex));
console.log(check);
// =============================================================================================
// Задача 10. Дано рядок тексту. Підрахувати кількість двоцифрових чисел у рядку.
const text4 = "«Сьогодні на складі було зареєстровано 45 нових коробок, які необхідно доставити до 12 магазинів. Загальна вага вантажу становить 78 кілограмів, а час прибуття заплановано на 14:30. Завтра планується доставка ще 345 нових коробок.»";
const regex2 = /\b\d{2}\b/g;
const result4 = text4.match(regex2)?.length;
console.log(result4);
// ==========================================================================
// Задача 11. Визначити чи може бути рядок тексту номером банківської картки (приклад: «4142-3433-2323-3434» ). Знайти усі такі номери (при цьому символи “-” можуть бути, а можуть і не бути, тобто так «4142343323233434».
const text5 = "Переказ коштів здійсніть на картку 4111-2222-3333-4444 або 5168.7500.1234.5678, а також можна на 4444555566667777.";
const regex3 = /\b\d{4}[.-]?\d{4}[.-]?\d{4}[.-]?\d{4}\b/g;
const checkNumbers = text5.match(regex3);
if (checkNumbers)
    console.log(true);
else
    console.log(false);
console.log(checkNumbers);
// =========================================================================================
// Задача 12. Дано адресу сайту. Визначити, чи є він урядовим (містить домен “gov”, але не обов”язково у кінці). Наприклад: “https://company.gov.ua”
const email = "https://min-digital-edu.gov.ua";
const email2 = "https://ilovegov.com";
const result5 = Boolean(email.match(/\.\gov\./gi));
const result6 = Boolean(email2.match(/\.\gov\./gi));
console.log(result5);
console.log(result6);
// ==========================================================================================
// Задача 13. Вибрати усі роки між 2020 та 2049 з отриманого повідомлення
const text6 = "Проєкт, який ми розпочали у 2020 році, розрахований на довгострокову перспективу. у 2023 році будуть завершені початкові роботи. У 2030 завершать усі будівельні роботи по проекту. На 2025 рік заплановано облагородження території. Офіційне відкриття у 2049 році.";
const regex5 = /\b20[234][0-9]\b/g;
const chooseYears = text6.match(regex5);
console.log(chooseYears);
// ==========================================================================
// Задача 14. Дано номер телефону. Перевірити, чи є цей телефон телефоном оператора Киїівстар
// 	067, 068, 096, 097, 098, 077
const phone = "+380966085638";
// const phone ="380994771290"
const regex4 = /(\+(380))?(6[78]\d{7}|9[678]\d{7}|77\d{7})/;
const checkPhone = phone.match(regex4);
if (checkPhone) {
    console.log(true);
}
// Задача 15. Користувач вводить прізвище та ім’я в одному рядку через пробіл.  Замінити пробіл на дефіс.
const userEnter = (prompt('Введіть прізвище та ім"я', ''));
const regex6 = / /g;
const replaceEl = userEnter?.replace(regex6, "-");
console.log(replaceEl);
// Задача 16. Користувач вводить дату у форматі «день.місяць.рік». Отримати рядкове представлення дати у форматі «місяць/рік»
const userDate = prompt('«день.місяць.рік»', '');
const regex7 = /(\d{2})\.(\d{2})\.(\d{4})/;
const chooseEl = userDate.replace(regex7, "$2/$3");
console.log(chooseEl);
//# sourceMappingURL=task3.js.map